books/ita/02/problems/01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Problem 2.1</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Problem 2.1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-07-16 20:00:34 FLE Daylight Time"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Problem 2.1</h1>


<blockquote>

<p>Bubblesort is a popular, but inefficient, sorting algorithm. It works by repeatedly
swapping adjacent elements that are out of order.
BUBBLESORT\((A)\)
</p>
<p>
    1 for i = 1 to A.length - 1
    2   for j = A.length downto i + 1
    3     if A[j] &lt; A[j - 1]
    4       exchange A[j] with A[j - 1]
</p>

<p>
a. Let A` denote the output of BUBBLESORT(A). To prove that BUBBLESORT
is correct, we need to prove that it terminates and that
\(A`[1] \leq A`[2] \leq ... \leq A`[n]\),     (2.3)
</p>
<p>
where n = A.length. In order to show that BUBBLESORT actually sorts, what
else do we need to prove?
</p>
<p>
The next two parts will prove inequality (2.3).
</p>
<p>
b. State precisely a loop invariant for the for loop in lines 2–4, and prove that this
loop invariant holds. Your proof should use the structure of the loop invariant
proof presented in this chapter.
</p>
<p>
c. Using the termination condition of the loop invariant proved in part (b), state
a loop invariant for the for loop in lines 1–4 that will allow you to prove inequality
(2.3). Your proof should use the structure of the loop invariant proof
presented in this chapter.
</p>
<p>
d. What is the worst-case running time of bubblesort? How does it compare to the
running time of insertion sort?
</p>
</blockquote>




<section>
<p>
{solution}
</section>
</p></div>

</body>
</html>
